print('\n----Level1-----1--------------')
'''با یک تاپل داده شده (1،2،3،4،5،6،7،8،9،10)،
 برنامه ای بنویسید تا مقادیر نیمه اول
را در یک خط و مقادیر نیمه آخر را در یک خط چاپ کند.'''


x = (1,2,3,4,5,6,7,8,9,10)
b = list(x)
print(tuple(b[0:4]))
print(tuple(b[4:9]))






print('\n----Level1-----2--------------')
'''برنامه ای بنویسید تا تاپل دیگری تولید و چاپ کند که
 مقادیر آن اعداد زوج در تاپل داده شده باشد
 (1،2،3،4،5،6،7،8،9،10).'''

x = (1,2,3,4,5,6,7,8,9,10)
lst = []
for i in x:
    if i % 2==0:
        lst.append(i)
print(tuple(lst))





print('\n----Level2-----3--------------')

'''برنامه ای بنویسید که بتواند اعداد زوج را با استفاده از
 تابع فیلتر فیلتر کند. لیست به شرح زیر است: [1،2،3،4،5،6،7،8،9،10].
 از filter استفاده شود'''
print(list(filter(lambda n:n%2==0,[1,2,3,4,5,6,7,8,9,10])))




print('\n----Level2-----4--------------')


'''برنامه ای بنویسید که بتواند با map() فهرستی بسازد که عناصر آن مربعی از عناصر در [1,2,3,4,5,6,7,8,9,10] باشد.

نکات از map() برای ایجاد لیست استفاده کنید. از لامبدا برای تعریف توابع ناشناس استفاده کنید.'''

print(list(map(lambda n:n**2,[1,2,3,4,5,6,7,8,9,10])))





print('\n----Level3-----5--------------')

# راه حل اول:
lst = [1,2,3,4,5,6,7,8,9,10]
x = list(map(lambda n:n**2,filter(lambda n:n%2==0,lst)))
print(x)


# راه حل دوم
print(list(map(lambda n:n**2,filter(lambda n:n%2==0,[1,2,3,4,5,6,7,8,9,10]))))





print('\n----Level3-----6--------------')
'''با استفاده از range, اعداد
 صفر تا بیست را بصورت فیلتر اعداد فرد را چاپ کند'''



print(list(filter(lambda n:n%3==0,range(0,21))))




print('\n----Level3-----7--------------')

'''با استفاده از range, اعداد بین صفر تا صد را به توان سه برساند'''



print(list(map(lambda n:n**3,range(0,101))))






print('\n----Level4-----8--------------')
'''کلاسی به نام Circle تعریف کنید که بتوان آن را با شعاع ساخت.
 کلاس Circle متدی دارد که می تواند مساحت را محاسبه کند.'''



class Circle:
    def __init__(self,r):
        self.r = r

    def f(self):
        return self.r ** 2 *3.14
ob1 = Circle(1)
print(ob1.f())




# لطفا ستاره هارم فراموش نکنید
